Repository: aliyzl/django-learning-platform
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: Courses
fa: دوره‌ها

source: Section
fa: بخش

source: Sections
fa: سرفصل‌ها

source: Text
fa: متن

source: Code Example
fa: مثال کد

source: Exercise
fa: تمرین

source: Content (English)
fa: محتوای (انگلیسی)

source: Content (Persian)
fa: محتوای (فارسی)

source: Windows Code Example
fa: مثال کد ویندوز

source: Mac Code Example
fa: مثال کد مک

source: Exercise (English)
fa: تمرین (انگلیسی)

source: Exercise (Persian)
fa: تمرین (فارسی)

source: Exercise Solution
fa: راه‌حل تمرین

source: Lesson
fa: درس

source: Lessons
fa: درس‌ها

source: AI Assistant
fa: دستیار هوشمند

source: Ask a question...
fa: سوالی بپرسید...

source: Send message
fa: ارسال پیام

source: Django Learning Platform
fa: پلتفرم آموزش Django

source: Master Django Web Development for Windows & Mac
fa: تسلط بر توسعه وب Django برای Windows و Mac

source: Multi-Platform
fa: چند پلتفرمی

source: Windows & Mac
fa: Windows و Mac

source: Mac Courses
fa: دوره‌های Mac

source: Optimized for macOS environment
fa: بهینه شده برای محیط macOS

source: Start Learning
fa: شروع یادگیری

source: Windows Courses
fa: دوره‌های Windows

source: Optimized for Windows environment
fa: بهینه شده برای محیط Windows

source: Universal Django courses
fa: دوره‌های Django عمومی

source: No courses available yet.
fa: هنوز دوره‌ای در دسترس نیست.

source: Check back soon for new content!
fa: به زودی برای محتوای جدید بازگردید!

source: Learn Django Framework - Complete Guide
fa: آموزش فریمورک Django - راهنمای کامل

source: Python Web Framework
fa: فریمورک وب پایتون

source: Master Django Framework
fa: تسلط بر فریمورک Django

source: The high-level Python web framework that encourages rapid development and clean, pragmatic design. Learn Django from scratch and build powerful web applications.
fa: فریمورک وب پایتون سطح بالا که توسعه سریع و طراحی پاک و عملی را تشویق می‌کند. Django را از ابتدا بیاموزید و برنامه‌های وب قدرتمند بسازید.

source: Start Learning Now
fa: همین حالا شروع کنید

source: Explore Architecture
fa: بررسی معماری

source: What is Django?
fa: Django چیست؟

source: Django is a high-level Python web framework that enables rapid development of secure and maintainable websites. Built by experienced developers, Django takes care of much of the hassle of web development, so you can focus on writing your app without needing to reinvent the wheel.
fa: Django یک فریمورک وب پایتون سطح بالا است که توسعه سریع وب‌سایت‌های امن و قابل نگهداری را امکان‌پذیر می‌کند. ساخته شده توسط توسعه‌دهندگان با تجربه، Django بسیاری از مشکلات توسعه وب را برطرف می‌کند، بنابراین می‌توانید روی نوشتن برنامه خود تمرکز کنید بدون نیاز به اختراع دوباره چرخ.

source: Batteries Included
fa: امکانات کامل (Batteries Included)

source: Django includes dozens of extras you can use to handle common web development tasks, from user authentication to RSS feeds.
fa: Django شامل ده‌ها ویژگی اضافی است که می‌توانید برای انجام کارهای رایج توسعه وب استفاده کنید، از احراز هویت کاربر تا خوراک RSS.

source: Security First
fa: امنیت در اولویت

source: Django helps developers avoid many common security mistakes by providing a framework that has been engineered to 'do the right things' to protect the website automatically.
fa: Django به توسعه‌دهندگان کمک می‌کند تا از بسیاری از اشتباهات رایج امنیتی جلوگیری کنند با ارائه فریمورکی که برای انجام «کارهای درست» برای محافظت خودکار از وب‌سایت طراحی شده است.

source: Scalable
fa: مقیاس‌پذیر

source: Some of the busiest sites on the web leverage Django's ability to quickly and flexibly scale to meet the heaviest traffic demands.
fa: برخی از شلوغ‌ترین سایت‌های وب از قابلیت Django برای مقیاس‌پذیری سریع و انعطاف‌پذیر برای پاسخ به سنگین‌ترین درخواست‌های ترافیکی استفاده می‌کنند.

source: Thriving Community
fa: جامعه کاربری پویا

source: Django has a large and active community with extensive documentation, packages, and support for developers of all levels.
fa: Django دارای جامعه بزرگ و فعالی است با مستندات گسترده، پکیج‌ها و پشتیبانی برای توسعه‌دهندگان در تمام سطوح.

source: Django Architecture
fa: معماری Django

source: Django follows the Model-View-Template (MVT) architectural pattern. Click on each component below to learn more about how Django handles requests and responses.
fa: Django از الگوی معماری Model-View-Template (MVT) پیروی می‌کند. روی هر یک از اجزا زیر کلیک کنید تا بیشتر در مورد نحوه مدیریت درخواست‌ها و پاسخ‌ها توسط Django بیاموزید.

source: HTTP Request
fa: درخواست HTTP

source: URL Routing
fa: مسیریابی URL

source: URL Configuration
fa: پیکربندی URL

source: Middleware
fa: میان‌افزار

source: Request Processing
fa: پردازش درخواست

source: Views
fa: Viewها

source: Business Logic
fa: منطق کسب‌وکار

source: Models
fa: مدل‌ها

source: ORM & Database
fa: ORM و پایگاه داده

source: Templates
fa: قالب‌ها

source: Presentation Layer
fa: لایه نمایش

source: Admin Interface
fa: پنل مدیریت

source: Auto-Generated Admin
fa: مدیریت خودکار تولید شده

source: HTTP Response
fa: پاسخ HTTP

source: Key Features
fa: ویژگی‌های کلیدی

source: Django provides a comprehensive set of features that make web development efficient and enjoyable.
fa: Django مجموعه جامعی از ویژگی‌ها را فراهم می‌کند که توسعه وب را کارآمد و لذت‌بخش می‌کند.

source: Object-Relational Mapping allows you to interact with databases using Python code instead of SQL. Define models and Django handles the database operations.
fa: Object-Relational Mapping به شما امکان می‌دهد با استفاده از کد Python به جای SQL با پایگاه داده تعامل کنید. مدل‌ها را تعریف کنید و Django عملیات پایگاه داده را مدیریت می‌کند.

source: Django automatically generates a production-ready admin interface for your models, allowing you to manage content without writing any additional code.
fa: Django به طور خودکار یک رابط مدیریت آماده تولید برای مدل‌های شما ایجاد می‌کند و به شما امکان می‌دهد بدون نوشتن کد اضافی محتوا را مدیریت کنید.

source: Authentication & Authorization
fa: احراز هویت و مجوز

source: Built-in user authentication system handles user accounts, groups, permissions, and cookie-based user sessions out of the box.
fa: سیستم احراز هویت کاربر داخلی، حساب‌های کاربری، گروه‌ها، مجوزها و جلسات کاربری مبتنی بر کوکی را به صورت پیش‌فرض مدیریت می‌کند.

source: Security Features
fa: ویژگی‌های امنیتی

source: Protection against SQL injection, XSS attacks, CSRF, clickjacking, and other common security vulnerabilities is built-in.
fa: محافظت در برابر تزریق SQL، حملات XSS، CSRF، کلیک‌جکینگ و سایر آسیب‌پذیری‌های رایج امنیتی به صورت داخلی موجود است.

source: Scalability
fa: مقیاس‌پذیری

source: Django is designed to help developers take applications from concept to completion as quickly as possible, and scale to handle high traffic.
fa: Django طراحی شده است تا به توسعه‌دهندگان کمک کند برنامه‌ها را از مفهوم تا تکمیل در کوتاه‌ترین زمان ممکن برسانند و برای مدیریت ترافیک بالا مقیاس‌پذیری داشته باشند.

source: Template Engine
fa: موتور قالب

source: Powerful template system that allows you to separate design from code, making it easy to create dynamic HTML pages.
fa: سیستم قالب قدرتمند که به شما امکان می‌دهد طراحی را از کد جدا کنید و ایجاد صفحات HTML پویا را آسان می‌کند.

source: Clean, elegant URL scheme is an important detail in a high-quality web application. Django encourages beautiful URL design.
fa: طرح URL تمیز و ظریف جزئیات مهمی در یک برنامه وب با کیفیت است. Django طراحی URL زیبا را تشویق می‌کند.

source: Extensibility
fa: قابلیت توسعه

source: Django's app architecture allows you to build reusable apps and leverage thousands of third-party packages from the Django ecosystem.
fa: معماری اپلیکیشن Django به شما امکان می‌دهد برنامه‌های قابل استفاده مجدد بسازید و از هزاران پکیج شخص ثالث از اکوسیستم Django استفاده کنید.

source: Why Learn Django?
fa: چرا Django بیاموزیم؟

source: Django is one of the most popular and in-demand web frameworks in the industry. Here's why it's worth learning.
fa: Django یکی از محبوب‌ترین و پرتقاضاترین فریمورک‌های وب در صنعت است. در اینجا دلایل ارزشمند بودن یادگیری آن آمده است.

source: Industry Standard
fa: استاندارد صنعتی

source: Used by major companies like Instagram, Spotify, Pinterest, and The Washington Post. Django powers some of the world's largest websites.
fa: استفاده شده توسط شرکت‌های بزرگی مانند Instagram، Spotify، Pinterest و The Washington Post. Django برخی از بزرگ‌ترین وب‌سایت‌های جهان را به حرکت درمی‌آورد.

source: Career Opportunities
fa: فرصت‌های شغلی

source: Django developers are in high demand. Learning Django opens up numerous job opportunities in web development, backend engineering, and full-stack development.
fa: توسعه‌دهندگان Django تقاضای بالایی دارند. یادگیری Django فرصت‌های شغلی متعددی در توسعه وب، مهندسی بک‌اند و توسعه فول‌استک باز می‌کند.

source: Rapid Development
fa: توسعه سریع

source: Django's 'batteries included' philosophy means you can build production-ready applications faster than with many other frameworks.
fa: فلسفه 'همه چیز آماده است' Django به این معنی است که می‌توانید برنامه‌های آماده تولید را سریع‌تر از بسیاری از فریمورک‌های دیگر بسازید.

source: Python Ecosystem
fa: اکوسیستم Python

source: Built on Python, one of the most popular and beginner-friendly programming languages, making it accessible to a wide range of developers.
fa: ساخته شده بر اساس Python، یکی از محبوب‌ترین و مناسب‌ترین زبان‌های برنامه‌نویسی برای مبتدیان، که آن را در دسترس طیف وسیعی از توسعه‌دهندگان قرار می‌دهد.

source: Quick Start Guide
fa: راهنمای شروع سریع

source: Get started with Django in just a few steps. Our comprehensive courses will guide you through everything you need to know.
fa: فقط در چند قدم با Django شروع کنید. دوره‌های جامع ما شما را در تمام آنچه نیاز دارید راهنمایی می‌کند.

source: Install Django
fa: نصب Django

source: Learn how to set up Django on your system, create virtual environments, and install dependencies.
fa: بیاموزید که چگونه Django را روی سیستم خود راه‌اندازی کنید، محیط‌های مجازی ایجاد کنید و وابستگی‌ها را نصب کنید.

source: Start Course
fa: شروع دوره

source: Create Your First Project
fa: ایجاد اولین پروژه شما

source: Set up your first Django project, understand the project structure, and run the development server.
fa: اولین پروژه Django خود را راه‌اندازی کنید، ساختار پروژه را درک کنید و سرور توسعه را اجرا کنید.

source: Build Models & Views
fa: ساخت مدل‌ها و Viewها

source: Create database models, build views, configure URLs, and understand Django's MVT architecture.
fa: مدل‌های پایگاه داده ایجاد کنید، viewها بسازید، URLها را پیکربندی کنید و معماری MVT Django را درک کنید.

source: Deploy Your App
fa: استقرار برنامه شما

source: Learn how to deploy your Django application to production servers and make it accessible to the world.
fa: بیاموزید که چگونه برنامه Django خود را روی سرورهای تولید استقرار دهید و آن را در دسترس جهان قرار دهید.

source: Ready to Start Your Django Journey?
fa: آماده شروع سفر Django خود هستید؟

source: Join thousands of developers learning Django. Master the framework that powers some of the world's most popular websites.
fa: به هزاران توسعه‌دهنده‌ای که Django می‌آموزند بپیوندید. بر فریمورکی که برخی از محبوب‌ترین وب‌سایت‌های جهان را به حرکت درمی‌آورد تسلط پیدا کنید.

source: Explore Courses
fa: کشف دوره‌ها

source: Learn More
fa: بیشتر بیاموزید
